CRM_для_разработки/src/BusinessProcesses/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>Продажа</name>
  <task>Task.Задача</task>
  <attributes>
    <name>НужнаДопОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетаУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

CRM_для_разработки/src/Enums/ВидыИТС/ВидыИТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИТС</name>
  <enumValues>
    <name>ПодпискаПРОФ</name>
  </enumValues>
  <enumValues>
    <name>ПодпискаТЕХНО</name>
  </enumValues>
  <enumValues>
    <name>ФрешПРОФ</name>
  </enumValues>
  <enumValues>
    <name>ФрешБазовая</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>Аренда</name>
  </enumValues>
  <enumValues>
    <name>ОтказОтОформления</name>
  </enumValues>
  <enumValues>
    <name>СтартЭДО</name>
  </enumValues>
  <enumValues>
    <name>ДругиеПРОФ</name>
  </enumValues>
  <enumValues>
    <name>ДругиеТЕХНО</name>
  </enumValues>
  <enumValues>
    <name>ПродажаБезУслуг</name>
  </enumValues>
</mdclass:Enum>

CRM_для_разработки/src/BusinessProcesses/Продажа/Forms/ФормаБизнесПроцесса/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
	Элементы.ИНН.Видимость = Ложь; 
	Элементы.ЗавершитьСоздание.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНового(Команда)
	
	Элементы.Клиент.Видимость = Ложь;  
	Элементы.ИНН.Видимость = Истина;
	Элементы.СоздатьНового.Видимость = Ложь;  
	Элементы.ЗавершитьСоздание.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСоздание(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ИНН) Тогда
		
		Сообщить("Не заполнен ИНН"); 
		Возврат;
		
	КонецЕсли;   
	
	Если НЕ ЗначениеЗаполнено(Объект.КонтактноеЛицо) ИЛИ НЕ (ЗначениеЗаполнено(Объект.Телефон) ИЛИ ЗначениеЗаполнено(Объект.Почта)) Тогда
		
		Сообщить("Не заполнены контактные данные"); 
		Возврат;
		
	КонецЕсли; 
	
	ЗавершитьСозданиеНаСервере();  
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьСозданиеНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	//Сначала поиск в CRM, контрагент может не отображаться из-за отсутствия договора или ИТС или просто проглядели
	Найденный = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", СокрЛП(Объект.ИНН));
	
	Если Найденный.Пустая() Тогда
		
		//Создание на стороне УТ и выгрузка в CRM
		//Запрос через веб-сервис
		//через контрагента и досье создает нового контрагента и партнера
		//создает и соглашение и договор
		//возвращает структуру с новым партнером  
		Найденный = СоздатьНовогоКонтрагентаВУТ();
		
	КонецЕсли;                                   
	
	ТекущийУровеньИТС = ОбщегоНазначения.ТекущийУровеньИТС(Найденный);
	
	Если НЕ ЗначениеЗаполнено(ТекущийУровеньИТС.Уровень) Тогда //Если нет ИТС и не заполнен вручную, ставим минимальный
		
		КонтрОбъект = Найденный.ПолучитьОбъект();
		КонтрОбъект.УточнениеДоговораИТС = Перечисления.ВидыИТС.ПродажаБезУслуг;
		КонтрОбъект.ДатаУточненияДоговораИТС = ТекущаяДата();
		КонтрОбъект.Записать();
		
	КонецЕсли;     
	
	СпрСотрудник = ПараметрыСеанса.ТекущийПользователь.ПолучитьОбъект();

	Найденные = СпрСотрудник.Доступ.Найти(Найденный, "Контрагент");    
	
	Если Найденные = Неопределено Тогда
		
		Найденные = СпрСотрудник.Доступ.Добавить();
		Найденные.Контрагент = Найденный;
		
	КонецЕсли;   
	
	Найденные.Данные = Истина;
    СпрСотрудник.Записать(); 
	
	Объект.Клиент = Найденный;
	
	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры   

&НаСервере
Функция СоздатьНовогоКонтрагентаВУТ()
	
	АдресВебСервисов = Константы.АдресВебСервисовУТ.Получить();
	
	Если Прав(АдресВебСервисов, 1) = "/" Тогда
		
		АдресВебСервисов = Лев(АдресВебСервисов, СтрДлина(АдресВебСервисов) - 1);
		
	КонецЕсли;
	
	ИмяПользователя = Константы.ИмяПользователяУТ.Получить();
	Пароль 			= Константы.ПарольУТ.Получить();
	
	Определение = Новый WSОпределения(АдресВебСервисов + "/ws/ut_exchange.1cws?wsdl", ИмяПользователя, Пароль);
	
	Прокси = Новый WSПрокси(Определение, "http://www.a-franch.ru", "ut_exchange", "ut_exchangeSoap");
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль 		= Пароль;
	
	ДанныеУТ = Прокси.newkontr(Объект.ИНН, Объект.КонтактноеЛицо, Объект.Телефон, Объект.Почта);		
	
КонецФункции
